In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [3]:
df

     A      B         C         D
0  foo    one  0.612431 -0.781635
1  bar    one  0.893993 -0.145488
2  foo    two  1.236723  1.071550
3  bar  three  0.382593  0.263359
4  foo    two -0.702355  1.407140
5  bar    two  1.013915  1.070299
6  foo    one  0.900147  1.216242
7  foo  three  0.659587  0.374667

In [4]:
grouped = df.groupby('A')
grouped.get_group('foo')

     A      B         C         D
0  foo    one  0.612431 -0.781635
2  foo    two  1.236723  1.071550
4  foo    two -0.702355  1.407140
6  foo    one  0.900147  1.216242
7  foo  three  0.659587  0.374667

In [5]:
grouped = df.groupby(['A', 'B'])
grouped.get_group(('foo','two'))

     A    B         C        D
2  foo  two  1.236723  1.07155
4  foo  two -0.702355  1.40714

In [6]:
def get_letter_type(letter):
    if letter.lower() in 'aeiou':
        return 'vowel'
    else:
        return 'consonant'

grouped = df.groupby(get_letter_type, axis=1)
grouped.get_group('vowel')

     A
0  foo
1  bar
2  foo
3  bar
4  foo
5  bar
6  foo
7  foo

In [7]:
lst = [1, 4, 3, 1, 2, 3]
s = pd.Series([1, 4, 3, 10, 20, 30], lst)
s

1     1
4     4
3     3
1    10
2    20
3    30
dtype: int64

In [8]:
grouped = s.groupby(level=0)
grouped.sum()

1    11
2    20
3    33
4     4
dtype: int64

In [9]:
df2 = pd.DataFrame({'X' : ['B', 'B', 'A', 'A'], 'Y' : [1, 2, 3, 4]})
df2

   X  Y
0  B  1
1  B  2
2  A  3
3  A  4

In [10]:
df2.groupby(['X'], sort=False).sum()

   Y
X
B  3
A  7

In [11]:
df.groupby('A').groups

{'bar': Int64Index([1, 3, 5], dtype='int64'),
 'foo': Int64Index([0, 2, 4, 6, 7], dtype='int64')}

In [12]:
len(df.groupby(get_letter_type, axis=1).groups)

2

In [13]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

index = pd.MultiIndex.from_arrays(arrays, names=['first', 'second'])

s = pd.Series(np.random.randn(8), index=index)

s

first  second
bar    one       0.539104
       two       0.376786
baz    one       2.233676
       two      -1.187469
foo    one       0.798998
       two       0.711417
qux    one       0.657395
       two      -0.194545
dtype: float64

In [14]:
grouped = s.groupby(level='first')

In [15]:
grouped.sum()

first
bar    0.915890
baz    1.046207
foo    1.510415
qux    0.462849
dtype: float64

In [16]:
grouped = df.groupby(['A'])

In [17]:
#Group the contents of column C using the keys in column A
grouped['C'].get_group('foo') 
df['C'].groupby(df['A']) # Same thing!
#grouped.get_group('foo')

In [18]:
grouped = df.groupby(['A', 'B'])

In [19]:
grouped.aggregate(np.sum)

                  C         D
A   B
bar one    0.893993 -0.145488
    three  0.382593  0.263359
    two    1.013915  1.070299
foo one    1.512578  0.434607
    three  0.659587  0.374667
    two    0.534368  2.478690

In [20]:
grouped.describe()

              C                                                              \
          count      mean       std       min       25%       50%       75%
A   B
bar one     1.0  0.893993       NaN  0.893993  0.893993  0.893993  0.893993
    three   1.0  0.382593       NaN  0.382593  0.382593  0.382593  0.382593
    two     1.0  1.013915       NaN  1.013915  1.013915  1.013915  1.013915
foo one     2.0  0.756289  0.203446  0.612431  0.684360  0.756289  0.828218
    three   1.0  0.659587       NaN  0.659587  0.659587  0.659587  0.659587
    two     2.0  0.267184  1.371135 -0.702355 -0.217586  0.267184  0.751954

                        D                                                    \
                max count      mean       std       min       25%       50%
A   B
bar one    0.893993   1.0 -0.145488       NaN -0.145488 -0.145488 -0.145488
    three  0.382593   1.0  0.263359       NaN  0.263359  0.263359  0.263359
    two    1.013915   1.0  1.070299       NaN  1.070299  1.070299  1.070299
foo one    0.900147   2.0  0.217303  1.412713 -0.781635 -0.282166  0.217303
    three  0.659587   1.0  0.374667       NaN  0.374667  0.374667  0.374667
    two    1.236723   2.0  1.239345  0.237298  1.071550  1.155448  1.239345


                75%       max
A   B
bar one   -0.145488 -0.145488
    three  0.263359  0.263359
    two    1.070299  1.070299
foo one    0.716773  1.216242
    three  0.374667  0.374667
    two    1.323243  1.407140

In [21]:
grouped = df.groupby('A')
grouped.agg([np.sum, np.mean, np.std])

            C                             D
          sum      mean       std       sum      mean       std
A
bar  2.290501  0.763500  0.335281  1.188169  0.396056  0.618660
foo  2.706533  0.541307  0.737922  3.287964  0.657593  0.893965

In [22]:
index = pd.date_range('10/1/1999', periods=1100)

In [23]:
ts = pd.Series(np.random.normal(0.5, 2, 1100), index)

In [24]:
ts = ts.rolling(window=100,min_periods=100).mean().dropna()

In [25]:
key = lambda x: x.year
zscore = lambda x: (x - x.mean()) / x.std()
transformed = ts.groupby(key).transform(zscore)
transformedgrouped_trans = transformed.groupby(key)
transformedgrouped_trans

In [26]:
grouped_trans = transformed.groupby(key)

In [27]:
sf = pd.Series([1, 1, 2, 3, 3, 3])
sf

0    1
1    1
2    2
3    3
4    3
5    3
dtype: int64

In [28]:
sf.groupby(sf).filter(lambda x: x.sum() > 2)

3    3
4    3
5    3
dtype: int64

In [29]:
dff = pd.DataFrame({'A': np.arange(8), 'B': list('aabbbbcc')})
dff

   A  B
0  0  a
1  1  a
2  2  b
3  3  b
4  4  b
5  5  b
6  6  c
7  7  c

In [30]:
dff.groupby('B').get_group('b')

   A  B
2  2  b
3  3  b
4  4  b
5  5  b

In [31]:
dff.groupby('B').filter(lambda x: len(x) > 2, dropna=False)

     A    B
0  NaN  NaN
1  NaN  NaN
2  2.0    b
3  3.0    b
4  4.0    b
5  5.0    b
6  NaN  NaN
7  NaN  NaN

In [32]:
import datetime

df = pd.DataFrame({
    'Branch' : 'A A A A A A A B'.split(),
    'Buyer': 'Carl Mark Carl Carl Joe Joe Joe Carl'.split(),
    'Quantity': [1,3,5,1,8,1,9,3],
    'Date' : [
        datetime.datetime(2013,1,1,13,0),
        datetime.datetime(2013,1,1,13,5),
        datetime.datetime(2013,10,1,20,0),
        datetime.datetime(2013,10,2,10,0),
        datetime.datetime(2013,10,1,20,0),
        datetime.datetime(2013,10,2,10,0),
        datetime.datetime(2013,12,2,12,0),
        datetime.datetime(2013,12,2,14,0),
    ]
})

In [33]:
df

  Branch Buyer                Date  Quantity
0      A  Carl 2013-01-01 13:00:00         1
1      A  Mark 2013-01-01 13:05:00         3
2      A  Carl 2013-10-01 20:00:00         5
3      A  Carl 2013-10-02 10:00:00         1
4      A   Joe 2013-10-01 20:00:00         8
5      A   Joe 2013-10-02 10:00:00         1
6      A   Joe 2013-12-02 12:00:00         9
7      B  Carl 2013-12-02 14:00:00         3

In [35]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)

df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [37]:
print (df.groupby('Team'))

<pandas.core.groupby.DataFrameGroupBy object at 0x11169c7b8>

In [39]:
print (df.groupby('Team').groups)

{'Devils': Int64Index([2, 3], dtype='int64'), 'Kings': Int64Index([4, 6, 7], dtype='int64'), 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'), 'Royals': Int64Index([9, 10], dtype='int64'), 'kings': Int64Index([5], dtype='int64')}

In [46]:
testgroup = df.groupby(['Team','Year'])

print (testgroup.groups)

{('Devils', 2014): Int64Index([2], dtype='int64'), ('Devils', 2015): Int64Index([3], dtype='int64'), ('Kings', 2014): Int64Index([4], dtype='int64'), ('Kings', 2016): Int64Index([6], dtype='int64'), ('Kings', 2017): Int64Index([7], dtype='int64'), ('Riders', 2014): Int64Index([0], dtype='int64'), ('Riders', 2015): Int64Index([1], dtype='int64'), ('Riders', 2016): Int64Index([8], dtype='int64'), ('Riders', 2017): Int64Index([11], dtype='int64'), ('Royals', 2014): Int64Index([9], dtype='int64'), ('Royals', 2015): Int64Index([10], dtype='int64'), ('kings', 2015): Int64Index([5], dtype='int64')}

In [47]:
for name, group in testgroup:
    print (name)
    print (group)

('Devils', 2014)
   Points  Rank    Team  Year
2     863     2  Devils  2014
('Devils', 2015)
   Points  Rank    Team  Year
3     673     3  Devils  2015
('Kings', 2014)
   Points  Rank   Team  Year
4     741     3  Kings  2014
('Kings', 2016)
   Points  Rank   Team  Year
6     756     1  Kings  2016
('Kings', 2017)
   Points  Rank   Team  Year
7     788     1  Kings  2017
('Riders', 2014)
   Points  Rank    Team  Year
0     876     1  Riders  2014
('Riders', 2015)
   Points  Rank    Team  Year
1     789     2  Riders  2015
('Riders', 2016)
   Points  Rank    Team  Year
8     694     2  Riders  2016
('Riders', 2017)
    Points  Rank    Team  Year
11     690     2  Riders  2017
('Royals', 2014)
   Points  Rank    Team  Year
9     701     4  Royals  2014
('Royals', 2015)
    Points  Rank    Team  Year
10     804     1  Royals  2015
('kings', 2015)
   Points  Rank   Team  Year
5     812     4  kings  2015

In [41]:
grouped = df.groupby('Year')

print (grouped.groups)

{2014: Int64Index([0, 2, 4, 9], dtype='int64'), 2015: Int64Index([1, 3, 5, 10], dtype='int64'), 2016: Int64Index([6, 8], dtype='int64'), 2017: Int64Index([7, 11], dtype='int64')}

In [43]:
for name,group in grouped:
    print (name)
    print (group)

2014
   Points  Rank    Team  Year
0     876     1  Riders  2014
2     863     2  Devils  2014
4     741     3   Kings  2014
9     701     4  Royals  2014
2015
    Points  Rank    Team  Year
1      789     2  Riders  2015
3      673     3  Devils  2015
5      812     4   kings  2015
10     804     1  Royals  2015
2016
   Points  Rank    Team  Year
6     756     1   Kings  2016
8     694     2  Riders  2016
2017
    Points  Rank    Team  Year
7      788     1   Kings  2017
11     690     2  Riders  2017

In [51]:
grouped = df.groupby('Year')
print (grouped.groups)
print (grouped.get_group(2014))

{2014: Int64Index([0, 2, 4, 9], dtype='int64'), 2015: Int64Index([1, 3, 5, 10], dtype='int64'), 2016: Int64Index([6, 8], dtype='int64'), 2017: Int64Index([7, 11], dtype='int64')}
   Points  Rank    Team  Year
0     876     1  Riders  2014
2     863     2  Devils  2014
4     741     3   Kings  2014
9     701     4  Royals  2014

In [52]:
grouped = df.groupby('Year')
grouped.groups

{2014: Int64Index([0, 2, 4, 9], dtype='int64'),
 2015: Int64Index([1, 3, 5, 10], dtype='int64'),
 2016: Int64Index([6, 8], dtype='int64'),
 2017: Int64Index([7, 11], dtype='int64')}

In [55]:
for name, group in grouped:
    print (name)
    print (group)

2014
   Points  Rank    Team  Year
0     876     1  Riders  2014
2     863     2  Devils  2014
4     741     3   Kings  2014
9     701     4  Royals  2014
2015
    Points  Rank    Team  Year
1      789     2  Riders  2015
3      673     3  Devils  2015
5      812     4   kings  2015
10     804     1  Royals  2015
2016
   Points  Rank    Team  Year
6     756     1   Kings  2016
8     694     2  Riders  2016
2017
    Points  Rank    Team  Year
7      788     1   Kings  2017
11     690     2  Riders  2017

In [57]:
print (grouped.get_group(2014))

   Points  Rank    Team  Year
0     876     1  Riders  2014
2     863     2  Devils  2014
4     741     3   Kings  2014
9     701     4  Royals  2014

In [59]:
print (grouped['Points'].agg(np.mean))

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64